Reports/ЖурналПротоколовВК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ЖурналПротоколовВК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиалы</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/ВрачебнаяКомиссия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВрачебнаяКомиссия</Name>
			<BasedOn>
				<xr:Item>Document.ЛистокНетрудоспособности</xr:Item>
				<xr:Item>Document.Прием</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.удалитьЦелиПроведенияВК</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаНетрудоспособности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛистокНетрудоспособности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияНетрудоспособности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассмотренныеВопросы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жалобы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тестовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Диагнозы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Диагноз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньОбоснованности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассификацииДиагнозов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНозологическойЕдиницы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассификацииДиагнозов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ЖурналПротоколовВК/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Формирует табличный документ журнала.
// 
// Возвращаемое значение:
//  ТабличныйДокумент - сформированный журнал.
//
Функция СформироватьОтчет() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Автомасштаб = Истина;
	ТабДок.КлючПараметровПечати = "ЖурналВрачебныхКомиссий";

	РезультатЗапроса = ВыполнитьЗапросПоВрачебнымКомиссиям();
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат ТабДок;	
	КонецЕсли;
	
	Макет = ПолучитьМакет("ЖурналВрачебныхКомиссий");
	
	РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(РезультатЗапроса[0].Ссылка);
	
	МассивДляПроверки = Новый Массив();
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ПредставлениеОрганизации = РеквизитыОрганизации.НазваниеОрганизации;
	Область.Параметры.ПериодНачала = Формат(ПериодНачало,"ДФ=dd.MM.yyyy");
	Область.Параметры.ПериодОкончание = Формат(ПериодОкончание,"ДФ=dd.MM.yyyy");
	МассивДляПроверки.Добавить(Область);
	
	Если ЗначениеЗаполнено(Ответственный) Тогда
		ТекстОтвественный = "";
		Область = Макет.ПолучитьОбласть("Ответственный");
		Если ЗначениеЗаполнено(Должность) Тогда
			ТекстОтвественный = Должность + ", ";	
		КонецЕсли; 
		ТекстОтвественный = ТекстОтвественный + ОбщегоНазначения.ФамилияИнициалыФизЛица(Ответственный);
		Область.Параметры.Ответственный = ТекстОтвественный;
		МассивДляПроверки.Добавить(Область);
	КонецЕсли; 
		
	Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
	МассивДляПроверки.Добавить(Область);
	
	Для Каждого СтрокаЗапроса Из РезультатЗапроса Цикл
		Если Не ТабДок.ПроверитьВывод(МассивДляПроверки) Тогда
			ИндексПоследнего = МассивДляПроверки.Количество()-1;
			ПоследняяОбласть = МассивДляПроверки[ИндексПоследнего];
			МассивДляПроверки.Удалить(ИндексПоследнего);
			Для Каждого Область Из МассивДляПроверки Цикл
				ТабДок.Вывести(Область);	
			КонецЦикла; 
			МассивДляПроверки.Очистить();
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
			МассивДляПроверки.Добавить(Область);
			МассивДляПроверки.Добавить(ПоследняяОбласть);
		КонецЕсли; 	
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Область.Параметры.Дата = Формат(СтрокаЗапроса.Дата, "ДФ='dd.MM.yyyy HH:mm'");
		Сотрудник = ОбщегоНазначения.ФамилияИнициалыФизЛица(СтрокаЗапроса.ПредседательКомиссии);
		ТекстСоставКомиссии = Сотрудник + " (председатель)";
		Для Каждого СтрокаСоставаКомиссии Из СтрокаЗапроса.СоставКомиссии Цикл
			Сотрудник = ОбщегоНазначения.ФамилияИнициалыФизЛица(СтрокаСоставаКомиссии.Сотрудник);
			ТекстСоставКомиссии = ТекстСоставКомиссии + ", " + Сотрудник;	
		КонецЦикла; 
		Область.Параметры.СоставКомиссии = ТекстСоставКомиссии;
		
		Если ЗначениеЗаполнено(СтрокаЗапроса.РассмотренныеВопросы) Тогда
			Область.Параметры.Вопросы = СтрокаЗапроса.РассмотренныеВопросы;
		ИначеЕсли ЗначениеЗаполнено(СтрокаЗапроса.ЦельПредставление) Тогда
			Область.Параметры.Вопросы = "Комиссия собрана с целью: " + СтрокаЗапроса.ЦельПредставление;
		КонецЕсли;
		Область.Параметры.Заключение = СтрокаЗапроса.Заключение;
		Область.Параметры.Документ = СтрокаЗапроса.Ссылка;
		МассивДляПроверки.Добавить(Область);
	КонецЦикла; 
	
	Для Каждого Область Из МассивДляПроверки Цикл
		ТабДок.Вывести(Область);	
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция ВыполнитьЗапросПоВрачебнымКомиссиям()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВрачебнаяКомиссия.Дата КАК Дата,
		|	ВрачебнаяКомиссия.РассмотренныеВопросы КАК РассмотренныеВопросы,
		|	ВрачебнаяКомиссия.Цель.Представление КАК ЦельПредставление,
		|	ВрачебнаяКомиссия.Заключение КАК Заключение,
		|	ВрачебнаяКомиссия.ПредседательКомиссии КАК ПредседательКомиссии,
		|	ВрачебнаяКомиссия.СоставКомиссии.(
		|		Сотрудник КАК Сотрудник
		|	) КАК СоставКомиссии,
		|	ВрачебнаяКомиссия.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВрачебнаяКомиссия КАК ВрачебнаяКомиссия
		|ГДЕ
		|	(ВрачебнаяКомиссия.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		|				И &ЕстьОтборПоФилиалу = ЛОЖЬ
		|			ИЛИ ВрачебнаяКомиссия.Филиал В ИЕРАРХИИ (&Филиал))";
	Запрос.УстановитьПараметр("ПериодНачало",ПериодНачало);
	Запрос.УстановитьПараметр("ПериодОкончание",КонецДня(ПериодОкончание));
	Запрос.УстановитьПараметр("Филиал", Филиалы);
	Запрос.УстановитьПараметр("ЕстьОтборПоФилиалу", Филиалы.Количество() > 0);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
		
КонецФункции

#КонецОбласти

#КонецЕсли
